Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/РубрикиОбъектовСУЗ/РубрикиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РубрикиОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рубрикатор</name>
    <type>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементРубрикатора</name>
    <type>
      <types>CatalogRef.ЭлементыРубрикатораСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ПеременныеВопросовСУЗ/ПеременныеВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПеременныеВопросовСУЗ</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Задание</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>Ответ</name>
  </enumValues>
  <enumValues>
    <name>Подсказка</name>
  </enumValues>
  <enumValues>
    <name>Описание</name>
  </enumValues>
  <enumValues>
    <name>ВариантОтвета</name>
  </enumValues>
  <enumValues>
    <name>ВерныйВариант</name>
  </enumValues>
  <enumValues>
    <name>ТипВопроса</name>
  </enumValues>
  <enumValues>
    <name>ПеремешиватьВарианты</name>
  </enumValues>
  <enumValues>
    <name>РазрешенРазвернутыйОтвет</name>
  </enumValues>
  <enumValues>
    <name>ШтрафЗаПодсказку</name>
  </enumValues>
  <enumValues>
    <name>МетодРасчетаРезультата</name>
  </enumValues>
  <enumValues>
    <name>Ресурс</name>
  </enumValues>
  <enumValues>
    <name>ОтображениеВариантов</name>
  </enumValues>
  <enumValues>
    <name>Пропустить</name>
  </enumValues>
  <enumValues>
    <name>Рубрикатор</name>
  </enumValues>
  <enumValues>
    <name>ЭлементРубрикатора</name>
  </enumValues>
  <enumValues>
    <name>ВесВопроса</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/МетодыРасчетаРезультатаВопросаСУЗ/МетодыРасчетаРезультатаВопросаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыРасчетаРезультатаВопросаСУЗ</name>
  <enumValues>
    <name>ТочноеСовпадение</name>
  </enumValues>
  <enumValues>
    <name>ПроцентВерных</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ОтображениеВариантовВопросаСУЗ/ОтображениеВариантовВопросаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтображениеВариантовВопросаСУЗ</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>Номер</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РубрикаторыСУЗ/РубрикаторыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РубрикаторыСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/Forms/ФормаСозданияИзФайлов/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	ПутьКФайлуСВопросами        = Параметры.ФайлДляЗагрузки;
	ПутьКФайлуРесурсов          = Параметры.РесурсыДляЗагрузки;
	ЭлектронныйРесурс           = Параметры.ЭлектронныйРесурс;
	РодительЭлементаСодержания  = ?(Параметры.ЭлементСодержания.ЭтоГруппа, Параметры.ЭлементСодержания, Параметры.ЭлементСодержания.Родитель);
    ПодборкаДляОбновления       = Параметры.ПодборкаДляОбновления;
	СформироватьТесты           = Параметры.СформироватьТесты;
	РодительЭлектронногоРесурса = ?(НЕ ЗначениеЗаполнено(Параметры.ГруппаЭлектронногоРесурса) ИЛИ Параметры.ГруппаЭлектронногоРесурса.ЭтоГруппа, Параметры.ГруппаЭлектронногоРесурса, Параметры.ГруппаЭлектронногоРесурса.Родитель);
	ЗакрыватьПослеЗагрузки      = Параметры.ЗакрыватьПослеЗагрузки;
	
	Если ЗначениеЗаполнено(ПодборкаДляОбновления) Тогда
		
		ИмяВладельцаВопросов = "Тест";
		
	ИначеЕсли ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		
		ИмяВладельцаВопросов = "ЭлектронныйРесурс";	
		
	Иначе
		
		Если СформироватьТесты Тогда
			ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс";
		Иначе
			ИмяВладельцаВопросов = "СправочникВопросов";
		КонецЕсли;

	КонецЕсли;
	
	Если ИмяВладельцаВопросов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаВопросов = "Тест" Тогда
		СформироватьТесты = Истина;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка вопросов в веб-клиенте не поддерживается'"));
	
	Отказ = Истина;
	
	Возврат;
	
	#Иначе
		
	Если ЗначениеЗаполнено(ПутьКФайлуСВопросами) Тогда
		ПрочитатьДанныеИзФайлаВопросов();
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СформироватьТестыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(ЭлектронныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуСВопросамиПриИзменении(Элемент)
	ПрочитатьДанныеИзФайлаВопросов();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуСВопросамиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// Формируем диалог выбора файлов
	
	Фильтр = НСтр("ru = 'Файл MS Excel '") + "(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = "";
	ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите файлы для загрузки'");
	
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуСВопросами = ДиалогОткрытияФайла.ПолноеИмяФайла;
	
	ПрочитатьДанныеИзФайлаВопросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуРесурсовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Формируем диалог выбора файлов
	
	Фильтр = НСтр("ru = 'Файл ZIP '") + "(*.zip)|*.zip";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = "";
	ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите файлы с ресурсами'");
	
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуРесурсов = ДиалогОткрытияФайла.ПолноеИмяФайла;

КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуСВопросами) Тогда
		Текст = НСтр("ru = 'Укажите путь к файлу с вопросами'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ПутьКФайлуСВопросами");
		Возврат;
	КонецЕсли;
	
	// Загружаем данные вспомогательных ресурсов на сервер
	//
	
	Если ЗначениеЗаполнено(ПутьКФайлуРесурсов) Тогда
		
		// Делаем проверки
		
		АрхивРесурсов = Новый Файл(ПутьКФайлуРесурсов);
		
		Если АрхивРесурсов.Расширение <> ".zip" Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Файлы ресурсов должны быть размещены в zip архиве'"));
			Возврат;
		КонецЕсли;
		
		// Очищаем предыдущие данные
		
		ПутьККаталогуРесурсовНаСервере = ""; 
		ПутьКФайлуРесурсовНаСервере    = "";
			
		// Помещаем файл на сервер
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияФайлаРесурсов", ЭтотОбъект);		
		
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлуРесурсов, Ложь, УникальныйИдентификатор);
	
	Иначе
		
		ВыполнитьИмпортПродолжение();
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияФайлаРесурсов(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
	
		ПутьКФайлуРесурсовНаСервере = ОбъектыСУЗ.ПолучитьПутьКПакетуДанных(Адрес, ВыбранноеИмяФайла);
		
		ВыполнитьИмпортПродолжение();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортПродолжение()

	// Выполняем импорт
	//
	
	Если ВыполнитьИмпортПакетаДанных() Тогда
	
		// Сохраняем настройки
		//
		
		ФайлНастроекОбъект = Новый Файл(ПолучитьИмяФайлаНастроек(ПутьКФайлуСВопросами));
			
		ТекстовыйДокументФН = Новый ТекстовыйДокумент;	
		ТекстовыйДокументФН.УстановитьТекст(СформироватьТекстФайлаНастроек());
		ТекстовыйДокументФН.Записать(ФайлНастроекОбъект.ПолноеИмя);
		
		ФайлНастроекОбъект.УстановитьНевидимость(Истина);
		
		// Оповещаем о результате импорта
		//
		
		Оповестить("ЭлектронныйРесурсЗаписан",, ЭтотОбъект);
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
		Оповестить("ПодборкаОбновлена", ПодборкаДляОбновления, ЭтотОбъект);
		Оповестить("ОбновленСправочникВопросов",, ЭтотОбъект);
		
		// Завершаем
		
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗавершенияИмпорта", ЭтотОбъект);		
			
		ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Загрузка успешно завершена'"));
		
	КонецЕсли;
	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаЗавершенияИмпорта(ДополнительныеПараметры) Экспорт
	
	Если ЗакрыватьПослеЗагрузки Тогда
		Закрыть(Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонФайлаСВопросами(Команда)
	
	ПолучитьФайл(ПолучитьАдресХраненияШаблонаФайлаСВопросами(), "QuizTemplate.zip", Истина);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// ОСНОВНЫЕ

&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаВопросов()
	
	#Если НЕ ВебКлиент Тогда
		
	// Убираем старые данные
	
	ПутьКФайлуРесурсов = "";
	ДанныеЛистов       = Неопределено;
	ИмяФайлаСВопросами = "";
	
	Колонки.Очистить();
	Тесты.Очистить();
	Вопросы.Очистить();
	
	Если ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс" Тогда
		// Будут заполнены из файла настроек
		ЭлектронныйРесурс     = Неопределено;
		ПодборкаДляОбновления = Неопределено;
	КонецЕсли;	
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуСВопросами) Тогда
		Возврат;
	КонецЕсли;	
	
	// Запоминаем имя файла с вопросами
	
	ФайлСВопросамиОбъект = Новый Файл(ПутьКФайлуСВопросами);
	ИмяФайлаСВопросами   = ФайлСВопросамиОбъект.ИмяБезРасширения;
	
	// Ищем файл с ресурсами
	
	РасширениеФайлаСВопросами = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ФайлСВопросамиОбъект.Имя));
	
	ФайлКФайлуСРесурсами = Новый Файл(Лев(ФайлСВопросамиОбъект.ПолноеИмя, СтрДлина(ФайлСВопросамиОбъект.ПолноеИмя) - СтрДлина(РасширениеФайлаСВопросами)) + "zip");
	
	Если ФайлКФайлуСРесурсами.Существует() Тогда
		ПутьКФайлуРесурсов = ФайлКФайлуСРесурсами.ПолноеИмя;
	КонецЕсли;
	
	// Читаем данные из файла	
	
	Попытка
		ExcelApp = Новый COMObject("Excel.Application");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Программа Excel не найдена '") + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Книга = ExcelApp.WorkBooks.Open(ПутьКФайлуСВопросами, 0);
	
	// Определяем колонки таблицы
	
	Лист1 = Книга.WorkSheets(1);
	
	НомерКолонки = 1;
	ИмяКолонки   = Лист1.Cells(1, НомерКолонки).Value;
	
	Пока ЗначениеЗаполнено(ИмяКолонки) Цикл
		
		НоваяСтрока = Колонки.Добавить();
		НоваяСтрока.Имя   = ИмяКолонки;
		НоваяСтрока.Номер = НомерКолонки;
		
		Попытка
			НоваяСтрока.Значение = ПредопределенноеЗначение("Перечисление.ПеременныеВопросовСУЗ." + ИмяКолонки);
		Исключение
			НоваяСтрока.Значение = ПредопределенноеЗначение("Перечисление.ПеременныеВопросовСУЗ.ПустаяСсылка");
		КонецПопытки;
		
		НомерКолонки = НомерКолонки + 1;
		ИмяКолонки   = СокрЛП(Строка(Лист1.Cells(1, НомерКолонки).Value));
		
	КонецЦикла;
	
	// Формируем данные вопросов для передачи на сервер
	
	КоличествоЛистов = Книга.WorkSheets.Count;
	
	МассивЛистов = Новый Массив();
	
	Для НомерЛиста = 1 По КоличествоЛистов Цикл // Перебираем листы
			
		Лист     = Книга.WorkSheets(НомерЛиста);
		ИмяЛиста = Лист.Name;
		
		// Проверяем не пустой ли лист
		
		Если Лист.UsedRange.Rows.Count = 1
			И Лист.UsedRange.Columns.Count = 1
			И ПустаяСтрока(Строка(Лист.Cells(1,1).Value)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// Проверяем, все ли колонки на листе указаны как в таблице "Колонки"
		
		КолонкиИдентичны = Истина;
		
		Для каждого Колонка Из Колонки Цикл
			
			ИмяКолонкиНаЛисте = СокрЛП(Строка(Лист.Cells(1, Колонка.Номер).Value));
			
			Если ИмяКолонкиНаЛисте <> Колонка.Имя Тогда
				
				КолонкиИдентичны = Ложь;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ КолонкиИдентичны Тогда
			
			Текст = НСтр("ru = 'Состав и имена колонок на всех листах файла должны быть идентичны'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			
			Продолжить;
			
		КонецЕсли;
		
		// Вопросы
		
		МассивВопросов = Новый Массив();
		
		ВопросыЗакончились = Ложь;
		НомерСтроки = 2; // Первая строка используется для названий колонок
		
		Пока НЕ ВопросыЗакончились Цикл // Перебираем вопросы (строки листа)
			
			// Формируем массив свойств вопроса
			
			МассивСвойств = Новый Массив;
			
			Для каждого Колонка Из Колонки Цикл
				
				ЗначениеЯчейки = СокрЛП(Строка(Лист.Cells(НомерСтроки, Колонка.Номер).Value));
						
				МассивСвойств.Добавить(ЗначениеЯчейки);
				
			КонецЦикла;
			
			// Определяем, закончились ли вопросы
			
			ВопросыЗакончились = Истина;
			
			Для каждого СвойствоВопроса Из МассивСвойств Цикл
			
				Если ЗначениеЗаполнено(СвойствоВопроса) Тогда
					ВопросыЗакончились = Ложь;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			// Переходим к следующему вопросу
			
			Если НЕ ВопросыЗакончились Тогда
				
				МассивВопросов.Добавить(Новый ФиксированныйМассив(МассивСвойств));
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивВопросов.Количество() > 0 Тогда
			
			МассивЛистов.Добавить(Новый ФиксированныйМассив(МассивВопросов));
			
			НовыйТест = Тесты.Добавить();
			НовыйТест.Имя                = ИмяЛиста;
			НовыйТест.КоличествоВопросов = МассивВопросов.Количество();
			НовыйТест.Номер              = НомерЛиста;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЛистов = Новый ФиксированныйМассив(МассивЛистов); 
	
	// Закрываем таблицу
	
	Книга.Close();
	
	// Заполняем таблицу вопросов
	
	ЗаполнитьТаблицуВопросов(); // На сервере
	
	// Получаем настройки из файла
	
	ПолучитьФайлНастроек();
	
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВопросов()
	
	Для каждого ДанныеЛиста Из ДанныеЛистов Цикл
		
		Для каждого ДанныеВопроса Из ДанныеЛиста Цикл
		
			ПропуститьВопрос = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Пропустить"], Истина, Неопределено, "Булево");
			
			Если ПропуститьВопрос <> Неопределено И ПропуститьВопрос Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Вопросы.Добавить();
			
			НоваяСтрока.Задание = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Задание"]);
	        НоваяСтрока.Код     = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Код"]);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьИмпортПакетаДанных()
	
	// Делаем проверки
	//
	
	ЕстьПолеКод           = Ложь;
	ЕстьПолеЗадание       = Ложь;
	ЕстьПолеВариантОтвета = Ложь;
	ЕстьПолеВерныйВариант = Ложь;
	
	Для каждого Строка Из Колонки Цикл
		
		Если Строка.Значение = Перечисления.ПеременныеВопросовСУЗ.Задание Тогда
			ЕстьПолеЗадание = Истина;
		КонецЕсли;
		
		Если Строка.Значение = Перечисления.ПеременныеВопросовСУЗ.ВариантОтвета Тогда
			ЕстьПолеВариантОтвета = Истина;
		КонецЕсли;
		
		Если Строка.Значение = Перечисления.ПеременныеВопросовСУЗ.ВерныйВариант Тогда
			ЕстьПолеВерныйВариант = Истина;
		КонецЕсли;
		
		Если Строка.Значение = Перечисления.ПеременныеВопросовСУЗ.Код Тогда
			ЕстьПолеКод = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьПолеКод Тогда
		Текст = НСтр("ru = 'Укажите поле ""Код""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЕстьПолеЗадание Тогда
		Текст = НСтр("ru = 'Укажите поле ""Задание""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЕстьПолеВариантОтвета Тогда
		Текст = НСтр("ru = 'Укажите поле ""Вариант ответа""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЕстьПолеВерныйВариант Тогда
		Текст = НСтр("ru = 'Укажите поле ""Верный вариант""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	// Распаковываем ресурсы
	//
	
	Если ЗначениеЗаполнено(ПутьКФайлуРесурсовНаСервере) Тогда
		
		ПутьККаталогуРесурсовНаСервере = КаталогВременныхФайлов(); // Реквизит		
		ПутьККаталогуРесурсовНаСервере = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурсовНаСервере);
		
		ФайлРесурсовОбъект = Новый Файл(ПутьКФайлуРесурсовНаСервере);
		
		ПутьККаталогуРесурсовНаСервере = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурсовНаСервере + ФайлРесурсовОбъект.ИмяБезРасширения); // Используем дальше
		
		СоздатьКаталог(ПутьККаталогуРесурсовНаСервере);
		
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКФайлуРесурсовНаСервере);
		ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРесурсовНаСервере, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 				

		УдалитьФайлы(ПутьКФайлуРесурсовНаСервере);
		
		ПутьКФайлуРесурсовНаСервере = "";
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Создаем электронный ресурс
	//
	
	Если (ИмяВладельцаВопросов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс") И СформироватьТесты И НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
		
		// Создаем электронный ресурс
		
		ЭлектронныйРесурсОбъект = Справочники.СводыЗнанийСУЗ.СоздатьЭлемент();	
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда 
				
			// Ссылка есть, но в базе объекта нет
			
			ЭлектронныйРесурсОбъект.УстановитьСсылкуНового(ЭлектронныйРесурс);
				
		КонецЕсли;
	
		ЭлектронныйРесурсОбъект.Наименование = ИмяФайлаСВопросами;
		ЭлектронныйРесурсОбъект.Родитель     = РодительЭлектронногоРесурса;
		ЭлектронныйРесурсОбъект.Редакция     = 0;
		ЭлектронныйРесурсОбъект.Тип          = ?(ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс", Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест, Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс);
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлектронныйРесурсОбъект);
		
		ЭлектронныйРесурсОбъект.Записать();
		
		ЭлектронныйРесурс = ЭлектронныйРесурсОбъект.Ссылка; // Запоминаем созданный электронный ресурс
		
	КонецЕсли;
	
	// Загружаем тесты (листы)
	//
	
	НомерЛиста = 0;
	
	Для каждого ДанныеЛиста Из ДанныеЛистов Цикл
		
		ПараметрыЛиста = Тесты.Получить(НомерЛиста);
		ИмяЛиста       = ПараметрыЛиста.Имя;
		
		Если СформироватьТесты Тогда
			
			// Получаем элементы справочников
			
			Если ЗначениеЗаполнено(ПодборкаДляОбновления) Тогда
				
				Подборка          = ПодборкаДляОбновления;
				ЭлементСодержания = Неопределено;
				
			Иначе
				
				Подборка          = ПараметрыЛиста.Тест;
				ЭлементСодержания = ПараметрыЛиста.ЭлементСодержанияДляОбновления;
				
				Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
					
					ПодборкаЭлементаСодержания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "СсылкаНаЭлемент");
					
					Если НЕ ЗначениеЗаполнено(Подборка) ИЛИ ПодборкаЭлементаСодержания <> Подборка Тогда
						Подборка = ПодборкаЭлементаСодержания;
						ПараметрыЛиста.Тест = Подборка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(Подборка) <> Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
				Подборка = Неопределено;
			КонецЕсли;	
			
			// Создаем элементы справочников при необходимости
			
			// Подборка (тест)
			
			Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Подборка) Тогда
				
				ПодборкаОбъект = Справочники.ПодборкиСУЗ.СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(Подборка) Тогда 
						
					// Ссылка есть, но в базе объекта нет
					
					ПодборкаОбъект.УстановитьСсылкуНового(Подборка);
						
				КонецЕсли;
				
				ПодборкаОбъект.Наименование                = ИмяЛиста;
				ПодборкаОбъект.Родитель                    = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, Тип("СправочникСсылка.ПодборкиСУЗ"));
				ПодборкаОбъект.ЭтоТест                     = Истина;
				ПодборкаОбъект.ПеремешиватьГруппыЭлементов = Истина;
				ПодборкаОбъект.ПоказыватьНавигацию         = Истина;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ПодборкаОбъект);
				
				ПодборкаОбъект.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация;
				
				ПодборкаОбъект.Записать();
				
				Подборка = ПодборкаОбъект.Ссылка;
				
				ПараметрыЛиста.Тест = Подборка;
				
				Если ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс" Тогда
					ПодборкаДляОбновления = Подборка;
				КонецЕсли;
				
			КонецЕсли;
			
			// Элемент содержания
			
			Если НЕ ПараметрыЛиста.Скрыть И НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
				
				Если ЗначениеЗаполнено(ЭлектронныйРесурс) И ЗначениеЗаполнено(Подборка) Тогда
					ЭлементСодержания = ОбщегоНазначенияСУ.НайтиЭлементСправочника("СодержаниеСУЗ", "СсылкаНаЭлемент", Подборка, ЭлектронныйРесурс, Ложь);	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
					
					ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
					ЭлементСодержанияОбъект.Наименование    = ИмяЛиста;
					ЭлементСодержанияОбъект.Владелец        = ЭлектронныйРесурс;
					ЭлементСодержанияОбъект.СсылкаНаЭлемент = Подборка;
					ЭлементСодержанияОбъект.Родитель        = РодительЭлементаСодержания;
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);

					ЭлементСодержанияОбъект.Записать();
					
					ЭлементСодержания = ЭлементСодержанияОбъект.Ссылка;
					
				КонецЕсли;
				
				ПараметрыЛиста.ЭлементСодержанияДляОбновления = ЭлементСодержания;
				
			КонецЕсли;
					
		КонецЕсли;
		
		// Обрабатываем вопросы на листе
		
		НомерВопроса = 0;
		
		Для каждого ДанныеВопроса Из ДанныеЛиста Цикл
			
			// Получаем ключевые реквизиты и данные вопроса
			
			ПропуститьВопрос = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Пропустить"], Истина, Неопределено, "Булево");
			
			Если ПропуститьВопрос <> Неопределено И ПропуститьВопрос Тогда
				НомерВопроса = НомерВопроса + 1; // Переходим к следующему вопросу
				Продолжить;
			КонецЕсли;
			
			// Получаем задание. Ключевой реквизит.
			
			Задание = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Задание"]);
			
			Если НЕ ЗначениеЗаполнено(Задание) Тогда
				НомерВопроса = НомерВопроса + 1; // Переходим к следующему вопросу
				Продолжить;
			КонецЕсли;
			
			// Ищем вопрос по коду.
			
			КодВопроса = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Код"]);
			
			Если НЕ ЗначениеЗаполнено(КодВопроса) Тогда
				ВызватьИсключение НСтр("ru = 'Код вопроса не задан'");
			КонецЕсли;
			
			ВопросТеста = Неопределено;
					
			НастройкиВопроса = Вопросы.НайтиСтроки(Новый Структура("Код", КодВопроса))[0];
			
			Если ЗначениеЗаполнено(НастройкиВопроса.Вопрос) Тогда
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(НастройкиВопроса.Вопрос) Тогда
					
					ВопросТеста = НастройкиВопроса.Вопрос.ПолучитьОбъект();	
					
				Иначе
					
					ВопросТеста = Справочники.ВопросыСУЗ.СоздатьЭлемент();
					
					ВопросТеста.УстановитьСсылкуНового(НастройкиВопроса.Вопрос);
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ВопросТеста);
					
				КонецЕсли;
				
				
			КонецЕсли;
			
			Если ИскатьПоКоду И ВопросТеста = Неопределено Тогда
				
				СсылкаНаВопрос = Справочники.ВопросыСУЗ.НайтиПоКоду(КодВопроса);
				
				Если ЗначениеЗаполнено(СсылкаНаВопрос) Тогда
					ВопросТеста = СсылкаНавопрос.ПолучитьОбъект();
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВопросТеста = Неопределено Тогда 
				
				ВопросТеста = Справочники.ВопросыСУЗ.СоздатьЭлемент();
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ВопросТеста);
				
			КонецЕсли;
			
			ВопросТеста.Код = КодВопроса;
			
			// Наименование
			
			ВопросТеста.Наименование = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Наименование"], Истина, Задание);
			
			// Родитель
			
			Если НЕ ЗначениеЗаполнено(ВопросТеста.Родитель) Тогда
				ВопросТеста.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, Тип("СправочникСсылка.ВопросыСУЗ"));
			КонецЕсли;
			
			// Поставщик и версия		
			
			Если ВопросТеста.Ссылка.Пустая() Тогда
				ВопросТеста.Версия = 1;
			Иначе
				ПоследняяВерсия = ОбъектыСУЗ.ПолучитьПоследнююВерсию(ВопросТеста.Ссылка, ВопросТеста.Поставщик);
				Если ПоследняяВерсия.Поставщик = ВопросТеста.Поставщик Тогда 
					ВопросТеста.Версия = ПоследняяВерсия.Версия;
				Иначе
					ВопросТеста.Версия = 1;
				КонецЕсли;
			КонецЕсли;
			
			// Формируем массив верных вариантов
			
			ВерныеВариантыСтрока  = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ВерныйВариант"], Истина);
			
			Разделитель = Неопределено;
			
			Если Найти(ВерныеВариантыСтрока, ",") > 0 Тогда
				Разделитель = ",";
			КонецЕсли;
			
			Если Найти(ВерныеВариантыСтрока, ";") > 0 Тогда
				Разделитель = ";";
			КонецЕсли;
			
			Если Разделитель = Неопределено Тогда
				
				МассивВерныхВариантов = Новый Массив();
				
				Попытка
					МассивВерныхВариантов.Добавить(Число(ВерныеВариантыСтрока));
				Исключение
					МассивВерныхВариантов.Добавить(0);
				КонецПопытки;
				
			Иначе
			
				МассивВерныхВариантов = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ВерныеВариантыСтрока, Разделитель);
				КоличествоЭлементов   = МассивВерныхВариантов.Количество();
				
				Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
				
					Попытка
						МассивВерныхВариантов[Индекс] = Число(МассивВерныхВариантов[Индекс]);
					Исключение
						МассивВерныхВариантов[Индекс] = 0;
					КонецПопытки;
				
				КонецЦикла;
				
			КонецЕсли;
			
			// Получаем простые реквизиты вопроса
			
			ВопросТеста.МетодРасчетаРезультата   = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["МетодРасчетаРезультата"], Истина, Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ТочноеСовпадение, "ПеречислениеСсылка.МетодыРасчетаРезультатаВопросаСУЗ");
			ВопросТеста.ПеремешиватьВарианты     = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ПеремешиватьВарианты"], Истина, Истина, "Булево");
			ВопросТеста.РазрешенРазвернутыйОтвет = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["РазрешенРазвернутыйОтвет"], Истина, Ложь, "Булево");
			ВопросТеста.ШтрафЗаПодсказку         = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ШтрафЗаПодсказку"], Истина, 0, "Число");
			ВопросТеста.ОтображениеВариантов     = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ОтображениеВариантов"], Истина, Перечисления.ОтображениеВариантовВопросаСУЗ.Текст, "ПеречислениеСсылка.ОтображениеВариантовВопросаСУЗ");
			
			ВопросТеста.ИспользуетсяФорматированныйДокумент = Истина;
			
			// Определяем тип вопроса
			
			ТипВопроса = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ТипВопроса"], Истина, Неопределено, "ПеречислениеСсылка.ТипыВопросовСУЗ");
			
			Если ТипВопроса = Неопределено Тогда
				
				Если МассивВерныхВариантов.Количество() > 1 Тогда
					ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногих;
				Иначе
					ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих;
				КонецЕсли;
				
			КонецЕсли;
			
			ВопросТеста.ТипВопроса = ТипВопроса;					   
						   
			// Ищем ресурс вопроса (картинка к заданию)
			
			Если ЗначениеЗаполнено(ПутьККаталогуРесурсовНаСервере) Тогда // Архив с ресурсами был загружен пользователем
			
				ОтносительныйПутьКРесурсуВопроса = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Ресурс"], Истина);
				
				УстановитьРесурс(ВопросТеста.ЭлементActiveX, ОтносительныйПутьКРесурсуВопроса); // В процедуре будет заполнен реквизит ВопросТеста.ЭлементActiveX
				
			КонецЕсли; // Закончили работать с ресурсом
			
			ВопросТеста.Записать(); // Записываем вопрос
			
			// Сохраняем ссылку на вопрос в настройках
			
			НастройкиВопроса = Вопросы.НайтиСтроки(Новый Структура("Код", КодВопроса))[0];

			НастройкиВопроса.Вопрос = ВопросТеста.Ссылка;
			
			// Сохраняем данные вопроса
			
			ЗаданиеФД = Новый ФорматированныйДокумент;
			ЗаданиеФД.УстановитьHTML(Задание, Новый Структура());
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ВопросТеста, ЗаданиеФД, "Вопрос", "ФорматированныйДокумент");
			
			ОтветФД = Новый ФорматированныйДокумент;
			ОтветФД.УстановитьHTML(РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Ответ"]), Новый Структура());
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ВопросТеста, ОтветФД, "Ответ", "ФорматированныйДокумент");

			ПодсказкаФД = Новый ФорматированныйДокумент;
			ПодсказкаФД.УстановитьHTML(РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Подсказка"]), Новый Структура());
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ВопросТеста, ПодсказкаФД, "Подсказка", "ФорматированныйДокумент");

			ОписаниеФД = Новый ФорматированныйДокумент;
			ОписаниеФД.УстановитьHTML(РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Описание"]), Новый Структура());
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ВопросТеста, ОписаниеФД, "Описание", "ФорматированныйДокумент");
			
			// Записываем варианты
			
			МассивВариантов  = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ВариантОтвета"], Ложь);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВариантыОтветовНаВопросСУЗ.Ссылка
				|ИЗ
				|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
				|ГДЕ
				|	ВариантыОтветовНаВопросСУЗ.Владелец = &Владелец
				|	И ВариантыОтветовНаВопросСУЗ.ЭтоГруппа = ЛОЖЬ";			
			Запрос.УстановитьПараметр("Владелец", ВопросТеста.Ссылка);			
			ВсеСуществующиеВарианты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			ЗагруженныеВарианты = Новый Массив;
			
			НомерВарианта = 0;
			
			Для каждого ТекстВарианта Из МассивВариантов Цикл
				
				НомерВарианта = НомерВарианта + 1; 
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВариантыОтветовНаВопросСУЗ.Ссылка
				|ИЗ
				|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
				|ГДЕ
				|	ВариантыОтветовНаВопросСУЗ.Код = &НомерВарианта
				|	И ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
				|	И ВариантыОтветовНаВопросСУЗ.ЭтоГруппа = ЛОЖЬ");
				
				Запрос.Параметры.Вставить("НомерВарианта", НомерВарианта);
				Запрос.Параметры.Вставить("Вопрос", ВопросТеста.Ссылка);
				
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					ВариантОбъект = Справочники.ВариантыОтветовНаВопросСУЗ.СоздатьЭлемент();
				Иначе
					Выборка = Результат.Выбрать();
					Выборка.Следующий();
					ВариантОбъект = Выборка.Ссылка.ПолучитьОбъект();
				КонецЕсли;
				
				ВариантОбъект.Код       = НомерВарианта;
				ВариантОбъект.Владелец  = ВопросТеста.Ссылка;
				ВариантОбъект.Верный    = ?(МассивВерныхВариантов.Найти(НомерВарианта) <> Неопределено, Истина, Ложь);
				ВариантОбъект.ПометкаУдаления = Ложь;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ВариантОбъект);
				
				// Ищем ресурс для варианта ответа
				
				Если ЗначениеЗаполнено(ПутьККаталогуРесурсовНаСервере) Тогда // Архив с ресурсами был загружен пользователем
					
					УстановитьРесурс(ВариантОбъект.Ресурс, ТекстВарианта); // В процедуре будет заполнен реквизит ВариантОбъект.Ресурс
					
				КонецЕсли; // Закончили работать с ресурсом
				
				// Записываем вариант
				
				ВариантОбъект.Записать();
				
				ЗагруженныеВарианты.Добавить(ВариантОбъект.Ссылка);
				
				СтруктураДанныхВариантов = Новый Структура;
				СтруктураДанныхВариантов.Вставить("ТекстовыеДанные", ?(ЗначениеЗаполнено(ВариантОбъект.Ресурс), "", ТекстВарианта));
				СтруктураДанныхВариантов.Вставить("ВерныйКомментарий", "");
				СтруктураДанныхВариантов.Вставить("ОшибочныйКомментарий", "");
				
				РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ВопросТеста, СтруктураДанныхВариантов, ВариантОбъект.Ссылка, "ВсеРеквизиты");	
			
			КонецЦикла;
			
			// Удаляем лишние варианты
			
			Для каждого ТекущийВариантОтвета Из ВсеСуществующиеВарианты Цикл
			
				Если ЗагруженныеВарианты.Найти(ТекущийВариантОтвета) = Неопределено Тогда
					ТекущийВариантОтветаОбъект = ТекущийВариантОтвета.ПолучитьОбъект();
					ТекущийВариантОтветаОбъект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			
			КонецЦикла;
			
			ВесВопроса = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ВесВопроса"], Истина, 1, "Число");
			
			// Помещаем вопрос в тест
			
			Если СформироватьТесты И ЗначениеЗаполнено(Подборка) Тогда
				
				// Элемент подборки

				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЭлементыПодборкиСУЗ.Ссылка
					|ИЗ
					|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
					|ГДЕ
					|	ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ЭлементыПодборкиСУЗ.Владелец = &Подборка
					|	И ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ = &Вопрос";

				Запрос.УстановитьПараметр("Вопрос", ВопросТеста.Ссылка);
				Запрос.УстановитьПараметр("Подборка", Подборка);

				Результат = Запрос.Выполнить();

				Если Результат.Пустой() Тогда
					
					// Элемент подборки всегда создаем свой для каждого вопроса
					
					ЭлементПодборкиОбъект = Справочники.ЭлементыПодборкиСУЗ.СоздатьЭлемент();
					ЭлементПодборкиОбъект.Наименование      = ВопросТеста.Наименование;
					ЭлементПодборкиОбъект.Владелец          = Подборка;
					ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ = ВопросТеста.Ссылка;
					ЭлементПодборкиОбъект.ВесВопроса        = ВесВопроса;
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);

					ЭлементПодборкиОбъект.Записать();
					
				Иначе
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ЭлементПодборкиОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						ЭлементПодборкиОбъект.Наименование = ВопросТеста.Наименование;
						ЭлементПодборкиОбъект.ВесВопроса   = ВесВопроса;
						
						ЭлементПодборкиОбъект.Записать();
						
					КонецЦикла;
					
				КонецЕсли;

			КонецЕсли;
			
			// Помещаем вопрос в рубрикатор
			
			НаименованиеРубрикатора = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["Рубрикатор"]);
			
			Если ЗначениеЗаполнено(НаименованиеРубрикатора) Тогда
				
				// Ищем рубрикатор, если нет, то создаем новый
				
				Рубрикатор = ОбщегоНазначенияСУ.НайтиЭлементСправочника("РубрикаторыСУЗ", "Наименование", НаименованиеРубрикатора);
				
				Если НЕ ЗначениеЗаполнено(Рубрикатор) Тогда
					
					РубрикаторОбъект = Справочники.РубрикаторыСУЗ.СоздатьЭлемент();
					РубрикаторОбъект.Наименование = НаименованиеРубрикатора;
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РубрикаторОбъект);
					
					РубрикаторОбъект.Записать();
					
					Рубрикатор = РубрикаторОбъект.Ссылка;
					
				КонецЕсли;
				
				// Создаем набор записей. Все вхождения вопроса в рубрики, отличные от указанных в файле будут удалены.
				
				НаборЗаписей = РегистрыСведений.РубрикиОбъектовСУЗ.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
				НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(ВопросТеста.Ссылка);
				
				// Добавляем вопрос в рубрики
				
				МассивЭлементовРубрикатора = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеВопроса, Колонки, Перечисления.ПеременныеВопросовСУЗ["ЭлементРубрикатора"], Ложь);
				
				Если МассивЭлементовРубрикатора.Количество() > 0 Тогда
					
					ТекущаяДата = ТекущаяДата();
					
					Для каждого НаименованиеЭлементаРубрикатора Из МассивЭлементовРубрикатора Цикл
						
						// Ищем элемент рубрикатора, если нет, то создаем новый
						
						ЭлементРубрикатора = ОбщегоНазначенияСУ.НайтиЭлементСправочника("ЭлементыРубрикатораСУЗ", "Наименование", НаименованиеЭлементаРубрикатора, Рубрикатор);
						
						Если НЕ ЗначениеЗаполнено(ЭлементРубрикатора) Тогда
							
							ЭлементРубрикатораОбъект = Справочники.ЭлементыРубрикатораСУЗ.СоздатьЭлемент();
							ЭлементРубрикатораОбъект.Наименование = НаименованиеЭлементаРубрикатора;
							ЭлементРубрикатораОбъект.Владелец     = Рубрикатор;
							
							РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементРубрикатораОбъект);
							
							ЭлементРубрикатораОбъект.Записать();
							
							ЭлементРубрикатора = ЭлементРубрикатораОбъект.Ссылка;
							
						КонецЕсли;
						
						НоваяЗапись = НаборЗаписей.Добавить();
						
						НоваяЗапись.Рубрикатор         = Рубрикатор;
						НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
						НоваяЗапись.Поставщик          = ВопросТеста.Поставщик;
						НоваяЗапись.СсылкаНаОбъектСУЗ  = ВопросТеста.Ссылка;
						НоваяЗапись.ДатаИзменения      = ТекущаяДата;
						НоваяЗапись.ВесВопроса         = ВесВопроса;
						
					КонецЦикла;
										
				КонецЕсли;
				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
			// Переходим к следующему вопросу
			
			НомерВопроса = НомерВопроса + 1;
			
		КонецЦикла; // Вопросы
		
		НомерЛиста = НомерЛиста + 1;
		
	КонецЦикла; // Листы
	
	// Завершаем
	//
	
	ЗафиксироватьТранзакцию();
	
	УстановитьДоступностьЭлементовФормы();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.СтраницаТесты.Видимость = ?(СформироватьТесты И ИмяВладельцаВопросов = "ЭлектронныйРесурс", Истина, Ложь);
	
	Если ИмяВладельцаВопросов = "ЭлектронныйРесурс" Тогда
		Элементы.СформироватьТесты.Доступность = Истина;
	Иначе
		Элементы.СформироватьТесты.Доступность = Ложь;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.ФайлДляЗагрузки) Тогда
		Элементы.ШаблонФайлаСВопросами.Видимость = Ложь; // Пользователь уже знает, как создать файл с тестами
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ФайлДляЗагрузки) Тогда
		Элементы.ПутьКФайлуСВопросами.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.РесурсыДляЗагрузки) Тогда	
		Элементы.ПутьКФайлуРесурсов.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	Если ИмяВладельцаВопросов = "СправочникВопросов" Тогда
		
		Элементы.ГруппаЗагрузить.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаЗагрузить.Видимость = Истина;
		
		Элементы.ГруппаЭлектронныйРесурс.Видимость = ?(ИмяВладельцаВопросов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс", Истина, Ложь);
		
	КонецЕсли;
	
	Если ИмяВладельцаВопросов <> "ЭлектронныйРесурс" Тогда
		Элементы.ТестыСкрыть.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// ФАЙЛ НАСТРОЕК

&НаСервере
Функция СформироватьТекстФайлаНастроек()
	
	// Получаем нужные переменные
	//
	
	ПутьКФайлуСВопросамиОбъект = Новый Файл(ПутьКФайлуСВопросами);
	ПутьКФайлуСРесурсамиОбъект = Новый Файл(ПутьКФайлуРесурсов);
	
	// Получаем XDTO
	//
	
	ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Файлы");
	ФайлНастроекXDTO    = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
	
	Если ЗначениеЗаполнено(АдресФайлаНастроекВХранилище) Тогда
		
		ПутьКФайлуНастроекНаСервере = ПолучитьИмяВременногоФайла("xml");
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаНастроекВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроекНаСервере);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроекНаСервере);
		
		// Получаем XDTO-объект файла настроек
		
		ФайлНастроекXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип); 
		
	КонецЕсли;
	
	// Ищем ФайлXDTO в существующем файле
	//
	
	ФайлXDTO = Неопределено;
	
	Для каждого Строка Из ФайлНастроекXDTO.Файл Цикл
	
		Если Строка.ИмяФайлаВопросов = ПутьКФайлуСВопросамиОбъект.Имя Тогда	
			ФайлXDTO = Строка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем новое описание файла
	
	Если ФайлXDTO = Неопределено Тогда
		
		ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Файл");
		ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
		
		ФайлНастроекXDTO.Файл.Добавить(ФайлXDTO);
		
	КонецЕсли;
	
	// Сохраняем настройки в файл
	//
	
	// Простые свойства
	
	ФайлXDTO.ИмяФайлаВопросов  = ПутьКФайлуСВопросамиОбъект.Имя;
	ФайлXDTO.ИмяФайлаРесурсов  = ПутьКФайлуСРесурсамиОбъект.Имя;
	
	// Колонки (перезаписываем старый список всегда)
	
	КолонкиXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Колонки");
	КолонкиXDTO     = ФабрикаXDTO.Создать(КолонкиXDTOТип);
	
	КолонкаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Колонка");
	
	Для каждого Строка Из Колонки Цикл
	
		КолонкаXDTO = ФабрикаXDTO.Создать(КолонкаXDTOТип);		
		КолонкаXDTO.Имя      = Строка.Имя;
		КолонкаXDTO.Значение = Строка.Значение;
		
		КолонкиXDTO.Колонка.Добавить(КолонкаXDTO);
		
	КонецЦикла;
	
	ФайлXDTO.Колонки = КолонкиXDTO;
	
	// Вопросы (перезаписываем старый список всегда)
	
	ВопросыXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Вопросы");
	ВопросыXDTO     = ФабрикаXDTO.Создать(ВопросыXDTOТип);
	
	ВопросXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Вопрос");
	
	Для каждого Строка Из Вопросы Цикл
	
		ВопросXDTO = ФабрикаXDTO.Создать(ВопросXDTOТип);		
		ВопросXDTO.Код    = Строка.Код;
		ВопросXDTO.Вопрос = Строка.Вопрос;
		
		ВопросыXDTO.Вопрос.Добавить(ВопросXDTO);
		
	КонецЦикла;
	
	ФайлXDTO.Вопросы = ВопросыXDTO;
	
	// ЭлектронныйРесурс
	
	Если ИмяВладельцаВопросов = "ЭлектронныйРесурс" Тогда
		
		ФайлXDTO.СформироватьТесты = СформироватьТесты;
		
		// Листы (обновляем старый список)
		
		ЛистыXDTO = ФайлXDTO.Листы;
		
	    Если ЛистыXDTO = Неопределено Тогда
		
			ЛистыXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Листы"));
			
			ФайлXDTO.Листы = ЛистыXDTO;
			
		КонецЕсли;
			
		Для каждого Строка Из Тесты Цикл
			
			ЛистXDTO = Неопределено;
			
			Для каждого СтрокаXDTO Из ЛистыXDTO.Лист Цикл
			
				Если СтрокаXDTO.Номер = Строка.Номер Тогда	
					ЛистXDTO = СтрокаXDTO;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЛистXDTO = Неопределено Тогда
				
				ЛистXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Лист"));		
				
				ЛистыXDTO.Лист.Добавить(ЛистXDTO);
				
			КонецЕсли;
			
			ЛистXDTO.Номер  = Строка.Номер;
			
			Если НЕ ЗначениеЗаполнено(ЛистXDTO.Тест) Тогда
				ЛистXDTO.Тест = Строка.Тест;
			КонецЕсли;
			
			ЛистXDTO.Скрыть = Строка.Скрыть;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// ТестКакЭлектронныйРесурс
	
	Если ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс" Тогда
		
		ФайлXDTO.ЭлектронныйРесурс = ЭлектронныйРесурс;
		
	КонецЕсли;
	
	// Завершаем
	//
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлНастроекXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаСервере
Процедура ЗагрузитьФайлНастроек()
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(АдресФайлаНастроекВХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем нужные переменные
	//
	
	ПутьКФайлуСВопросамиОбъект = Новый Файл(ПутьКФайлуСВопросами);
	
	// Читаем файл настроек
	
	ПутьКФайлуНастроекНаСервере = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаНастроекВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроекНаСервере);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроекНаСервере);
	
	// Получаем XDTO-объект файла настроек
	//
	
	ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportQuizSettings", "Файлы");
	ФайлНастроекXDTO    = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
	ФайлНастроекXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип); 
	
	// Ищем данные для текущего файла (в файле настроек могут быть данные нескольких файлов).
	
	ФайлXDTO = Неопределено;
	
	Для каждого Строка Из ФайлНастроекXDTO.Файл Цикл
	
		Если Строка.ИмяФайлаВопросов = ПутьКФайлуСВопросамиОбъект.Имя Тогда	
			
			ФайлXDTO = Строка;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем настройки из файла
	//
	
	Если ФайлXDTO <> Неопределено Тогда
		
		// Колонки
		
		Для каждого Строка Из Колонки Цикл
			
			Если ЗначениеЗаполнено(Строка.Значение) Тогда
				Продолжить; // Значение уже найдено по имени колонки
			КонецЕсли;
			
			КолонкаXDTO = Неопределено;
			
			Для каждого СтрокаXDTO Из ФайлXDTO.Колонки.Колонка Цикл	
				
				Если СтрокаXDTO.Имя = Строка.Имя Тогда
					КолонкаXDTO = СтрокаXDTO;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если КолонкаXDTO <> Неопределено Тогда
				Строка.Значение = КолонкаXDTO.Значение;	
			КонецЕсли;
			
		КонецЦикла;
		
		// Вопросы
		
		Если ФайлXDTO.Вопросы <> Неопределено Тогда
		
			Для каждого Строка Из Вопросы Цикл
				
				ВопросXDTO = Неопределено;
				
				Для каждого СтрокаXDTO Из ФайлXDTO.Вопросы.Вопрос Цикл	
					
					Если СтрокаXDTO.Код = Строка.Код Тогда
						ВопросXDTO = СтрокаXDTO;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ВопросXDTO <> Неопределено Тогда
					Строка.Вопрос = ВопросXDTO.Вопрос;	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		// ТестКакЭлектронныйРесурс
		
		Если ИмяВладельцаВопросов = "ТестКакЭлектронныйРесурс" Тогда
			
			ЭлектронныйРесурс = ФайлXDTO.ЭлектронныйРесурс;
			
			Если НЕ ЗначениеЗаполнено(ПодборкаДляОбновления)
				И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
				
				ПодборкаДляОбновления = Справочники.СводыЗнанийСУЗ.Тест(ЭлектронныйРесурс);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// ЭлектронныйРесурс
		
		Если ИмяВладельцаВопросов = "ЭлектронныйРесурс" Тогда
			
			Если ФайлXDTO.СформироватьТесты <> Неопределено Тогда
				
				СформироватьТесты = ФайлXDTO.СформироватьТесты;
			
			КонецЕсли;
				
			Если ФайлXDTO.Листы <> Неопределено Тогда
			
				Для каждого Строка Из Тесты Цикл
					
					ЛистXDTO = Неопределено;
					
					Для каждого СтрокаXDTO Из ФайлXDTO.Листы.Лист Цикл
					
						Если СтрокаXDTO.Номер = Строка.Номер Тогда
							ЛистXDTO = СтрокаXDTO;
							Прервать;	
						КонецЕсли;
					
					КонецЦикла;
					
					Если ЛистXDTO <> Неопределено Тогда
						
						Строка.Тест   = ЛистXDTO.Тест;	
						Строка.Скрыть = ЛистXDTO.Скрыть;	
						
						Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
							Строка.ЭлементСодержанияДляОбновления = ОбщегоНазначенияСУ.НайтиЭлементСправочника("СодержаниеСУЗ", "СсылкаНаЭлемент", Строка.Тест, ЭлектронныйРесурс, Ложь);
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	// Завершаем
	//
	
	ЧтениеXML.Закрыть();
	
	УдалитьФайлы(ПутьКФайлуНастроекНаСервере);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлНастроек()
	
	ПутьКФайлуНастроек = ПолучитьИмяФайлаНастроек(ПутьКФайлуСВопросами);
	
	ФайлНастроекОбъект = Новый Файл(ПутьКФайлуНастроек);
	
	Если ФайлНастроекОбъект.Существует() И НЕ ФайлНастроекОбъект.ЭтоКаталог() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияФайлаНастроек", ЭтотОбъект);		
		
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлуНастроек, Ложь, УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияФайлаНастроек(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		АдресФайлаНастроекВХранилище = Адрес; // Реквизит
		ЗагрузитьФайлНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяФайлаНастроек(ПутьКФайлуСВопросами="")
	
	ИмяФайлаНастроек = "v8_QuizImportSettings.xml";
	
	Если ЗначениеЗаполнено(ПутьКФайлуСВопросами) Тогда
		
		ПутьКФайлуСВопросамиОбъект = Новый Файл(ПутьКФайлуСВопросами);
		
		ИмяФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлуСВопросамиОбъект.Путь) + ИмяФайлаНастроек;
		
	КонецЕсли;
	
	Возврат ИмяФайлаНастроек; 
	
КонецФункции

// ВСПОМОГАТЕЛЬНЫЕ

&НаСервере
Процедура УстановитьРесурс(Ресурс, ОтносительныйПутьКРесурсу)
	
	Если ЗначениеЗаполнено(ОтносительныйПутьКРесурсу) Тогда
	
		ПутьКФайлуРесурса = ПутьККаталогуРесурсовНаСервере + ОтносительныйПутьКРесурсу;
		ПутьКФайлуРесурса = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(ПутьКФайлуРесурса);
		
		ФайлРесурса = Новый Файл(ПутьКФайлуРесурса);
		
		Если ФайлРесурса.Существует() И НЕ ФайлРесурса.ЭтоКаталог() Тогда
			
			// Создаем новый ресурс при необходимости
			
			Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
				
				РесурсОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
				РесурсОбъект.Наименование = ФайлРесурса.ИмяБезРасширения;
				РесурсОбъект.Родитель     = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, Тип("СправочникСсылка.РесурсыСУЗ"));
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РесурсОбъект);
				
				РесурсОбъект.Записать();
				
				Ресурс = РесурсОбъект.Ссылка; // Устанавливаем значение нового ресурса
				
			КонецЕсли;
				
			// Ищем файл в ресурсе
			
			Справочники.ФайлыСУЗ.ОбновитьФайлРесурса(
				Ресурс,
				ФайлРесурса.Имя,
				ФайлРесурса.ИмяБезРасширения,
				Новый ДвоичныеДанные(ФайлРесурса.ПолноеИмя),
				ФайлРесурса.Имя,
				ФайлРесурса.Расширение,
				Истина);
						
		Иначе
			
			Ресурс = Справочники.РесурсыСУЗ.ПустаяСсылка(); // Сбрасываем ресурс
			
		КонецЕсли;
	
	Иначе
	
		Ресурс = Справочники.РесурсыСУЗ.ПустаяСсылка(); // Сбрасываем ресурс
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХраненияШаблонаФайлаСВопросами()
	
	ДвоичныеДанные = Справочники.ПодборкиСУЗ.ПолучитьМакет("ШаблонФайловДляИмпорта");
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
